       identification division.
       program-id. prgrama de prueba.
       
       environment division.
       configuration section.
       
       data division.
       working-storage section.
       
       procedure division.
        
        goback.
       
       end program prgrama de prueba.